src/AccumulationRegisters/ЗарплатаКВыплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ЗарплатаКВыплате</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаКВыплате</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеЗарплатыКВыплате</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоходаИсполнительногоПроизводства</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоходовИсполнительногоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ЗарплатаКВыплатеАвансом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ЗарплатаКВыплатеАвансом</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаКВыплате</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеЗарплатыКВыплате</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеЗарплатыКВыплате</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоходаИсполнительногоПроизводства</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоходовИсполнительногоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/CommonModules/ВзаиморасчетыССотрудникамиБазовый/Ext/Module.bsl
&ИзменениеИКонтроль("СоздатьВТЗарплатаКВыплатеАванс")
Процедура Расш_СоздатьВТЗарплатаКВыплатеАванс(МенеджерВременныхТаблиц, ТолькоРазрешенные, Параметры, ИмяВТСотрудники) 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций.РасчетЗарплаты") Тогда
		МодульВыплатаЗарплатыДляНебольшихОрганизаций = ОбщегоНазначения.ОбщийМодуль("ВыплатаЗарплатыДляНебольшихОрганизаций");
		Если МодульВыплатаЗарплатыДляНебольшихОрганизаций.СоздатьВТЗарплатаКВыплатеАванс(
				МенеджерВременныхТаблиц, ТолькоРазрешенные, Параметры, ИмяВТСотрудники) Тогда
			
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",              Параметры.Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации",        Параметры.ПериодРегистрации);
	Запрос.УстановитьПараметр("СтатьяФинансирования",     Параметры.СтатьяФинансирования);
	Запрос.УстановитьПараметр("СтатьяРасходов",           Параметры.СтатьяРасходов);
	Запрос.УстановитьПараметр("ВидыДоходов",              Параметры.ВидыДоходов);	
	Запрос.УстановитьПараметр("ИгнорируемыеРегистраторы", Параметры.ИгнорируемыеРегистраторы);	
	
	ВыплачиватьПлановыйАванс = УчетНДФЛ.ДатаЗакона263ФЗ() > Параметры.Дата;
	
	Если ВыплачиватьПлановыйАванс Тогда
		// Получаем размеры плановых авансов сотрудников
		ВзаиморасчетыССотрудниками.СоздатьВТПлановыйАванс(МенеджерВременныхТаблиц, Истина, Параметры, ИмяВТСотрудники);
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
		|		ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
		|		ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
		|		ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка) КАК СтатьяФинансирования,
		|		ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка) КАК СтатьяРасходов,
		|		ЗНАЧЕНИЕ(Перечисление.ВидыДоходовИсполнительногоПроизводства.ПустаяСсылка) КАК ВидДоходаИсполнительногоПроизводства,
		|		НЕОПРЕДЕЛЕНО КАК ДокументОснование,
		|		0 КАК СуммаКВыплате
		|ПОМЕСТИТЬ ВТПлановыйАванс";
		Запрос.Выполнить();
	КонецЕсли;

	// Определяем суммы авансов к выплате
	#Удаление
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗарплатаКВыплатеОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток КАК СуммаКВыплатеОстаток
	|ПОМЕСТИТЬ ВТОтрицательноеСальдоПоЗарплате
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате.Остатки(
	|			КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ),
	|			ПериодВзаиморасчетов < &ПериодРегистрации
	|				И Сотрудник В
	|					(ВЫБРАТЬ
	|						Сотрудники.Сотрудник
	|					ИЗ
	|						#ВТСотрудники КАК Сотрудники)) КАК ЗарплатаКВыплатеОстатки
	|ГДЕ
	|	ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗарплатаКВыплате.Сотрудник КАК Сотрудник,
	|	ЗарплатаКВыплате.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗарплатаКВыплате.Подразделение КАК Подразделение,
	|	ЗарплатаКВыплате.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ЗарплатаКВыплате.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗарплатаКВыплате.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	|	ЗарплатаКВыплате.ДокументОснование КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплате.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -ЗарплатаКВыплате.СуммаКВыплате
	|		ИНАЧЕ ЗарплатаКВыплате.СуммаКВыплате
	|	КОНЕЦ КАК СуммаКВыплате
	|ПОМЕСТИТЬ ВТОстаткиПоЗарплате
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате КАК ЗарплатаКВыплате
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтрицательноеСальдоПоЗарплате КАК ВТОтрицательноеСальдоПоЗарплате
	|		ПО ЗарплатаКВыплате.ФизическоеЛицо = ВТОтрицательноеСальдоПоЗарплате.ФизическоеЛицо
	|ГДЕ
	|	ЗарплатаКВыплате.Регистратор В(&ИгнорируемыеРегистраторы)
	|	И ЗарплатаКВыплате.Период < КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|	И ЗарплатаКВыплате.ПериодВзаиморасчетов < &ПериодРегистрации
	|	И ЗарплатаКВыплате.Сотрудник В
	|			(ВЫБРАТЬ
	|				Сотрудники.Сотрудник
	|			ИЗ
	|				#ВТСотрудники КАК Сотрудники)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗарплатаКВыплатеОстатки.Сотрудник,
	|	ЗарплатаКВыплатеОстатки.ФизическоеЛицо,
	|	ЗарплатаКВыплатеОстатки.Подразделение,
	|	ЗарплатаКВыплатеОстатки.СтатьяФинансирования,
	|	ЗарплатаКВыплатеОстатки.СтатьяРасходов,
	|	ЗарплатаКВыплатеОстатки.ВидДоходаИсполнительногоПроизводства,
	|	ЗарплатаКВыплатеОстатки.ДокументОснование,
	|	ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате.Остатки(
	|			КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ),
	|			Сотрудник В
	|					(ВЫБРАТЬ
	|						Сотрудники.Сотрудник
	|					ИЗ
	|						#ВТСотрудники КАК Сотрудники)
	|				И Организация = &Организация
	|				И ПериодВзаиморасчетов < &ПериодРегистрации) КАК ЗарплатаКВыплатеОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтрицательноеСальдоПоЗарплате КАК ВТОтрицательноеСальдоПоЗарплате
	|		ПО ЗарплатаКВыплатеОстатки.ФизическоеЛицо = ВТОтрицательноеСальдоПоЗарплате.ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыйАванс.Сотрудник КАК Сотрудник,
	|	ПлановыйАванс.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПлановыйАванс.Подразделение КАК Подразделение,
	|	ПлановыйАванс.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ПлановыйАванс.СтатьяРасходов КАК СтатьяРасходов,
	|	ПлановыйАванс.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОснование,
	|	ПлановыйАванс.СуммаКВыплате КАК СуммаКВыплате
	|ПОМЕСТИТЬ ВТАванс
	|ИЗ
	|	ВТПлановыйАванс КАК ПлановыйАванс
	|ГДЕ
	|	&ОтборПоСтатьям
	|	И ПлановыйАванс.ВидДоходаИсполнительногоПроизводства В(&ВидыДоходов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗарплатаКВыплатеОстатки.Сотрудник,
	|	ЗарплатаКВыплатеОстатки.ФизическоеЛицо,
	|	ЗарплатаКВыплатеОстатки.Подразделение,
	|	ЗарплатаКВыплатеОстатки.СтатьяФинансирования,
	|	ЗарплатаКВыплатеОстатки.СтатьяРасходов,
	|	ЗарплатаКВыплатеОстатки.ВидДоходаИсполнительногоПроизводства,
	|	ЗарплатаКВыплатеОстатки.ДокументОснование,
	|	ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплатеАвансом.Остатки(
	|			КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ),
	|			Сотрудник В
	|					(ВЫБРАТЬ
	|						Сотрудники.Сотрудник
	|					ИЗ
	|						#ВТСотрудники КАК Сотрудники)
	|				И Организация = &Организация
	|				И ПериодВзаиморасчетов = &ПериодРегистрации
	|				И &ОтборПоСтатьям
	|				И ВидДоходаИсполнительногоПроизводства В (&ВидыДоходов)) КАК ЗарплатаКВыплатеОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗарплатаКВыплате.Сотрудник,
	|	ЗарплатаКВыплате.ФизическоеЛицо,
	|	ЗарплатаКВыплате.Подразделение,
	|	ЗарплатаКВыплате.СтатьяФинансирования,
	|	ЗарплатаКВыплате.СтатьяРасходов,
	|	ЗарплатаКВыплате.ВидДоходаИсполнительногоПроизводства,
	|	ЗарплатаКВыплате.ДокументОснование,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплате.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -ЗарплатаКВыплате.СуммаКВыплате
	|		ИНАЧЕ ЗарплатаКВыплате.СуммаКВыплате
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплатеАвансом КАК ЗарплатаКВыплате
	|ГДЕ
	|	ЗарплатаКВыплате.Регистратор В(&ИгнорируемыеРегистраторы)
	|	И ЗарплатаКВыплате.Период < КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|	И ЗарплатаКВыплате.ПериодВзаиморасчетов = &ПериодРегистрации
	|	И ЗарплатаКВыплате.Организация = &Организация
	|	И &ОтборПоСтатьям
	|	И ЗарплатаКВыплате.ВидДоходаИсполнительногоПроизводства В(&ВидыДоходов)
	|	И ЗарплатаКВыплате.Сотрудник В
	|			(ВЫБРАТЬ
	|				Сотрудники.Сотрудник
	|			ИЗ
	|				#ВТСотрудники КАК Сотрудники)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстаткиПоЗарплате.Сотрудник КАК Сотрудник,
	|	ВТОстаткиПоЗарплате.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТОстаткиПоЗарплате.Подразделение КАК Подразделение,
	|	ВТОстаткиПоЗарплате.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ВТОстаткиПоЗарплате.СтатьяРасходов КАК СтатьяРасходов,
	|	ВТОстаткиПоЗарплате.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	|	ВТОстаткиПоЗарплате.ДокументОснование КАК ДокументОснование,
	|	ВТОстаткиПоЗарплате.СуммаКВыплате КАК СуммаКВыплате
	|ПОМЕСТИТЬ ВТАвансИЗарплата
	|ИЗ
	|	ВТОстаткиПоЗарплате КАК ВТОстаткиПоЗарплате
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТАванс.Сотрудник,
	|	ВТАванс.ФизическоеЛицо,
	|	ВТАванс.Подразделение,
	|	ВТАванс.СтатьяФинансирования,
	|	ВТАванс.СтатьяРасходов,
	|	ВТАванс.ВидДоходаИсполнительногоПроизводства,
	|	ВТАванс.ДокументОснование,
	|	ВТАванс.СуммаКВыплате
	|ИЗ
	|	ВТАванс КАК ВТАванс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТАвансИЗарплата.Сотрудник КАК Сотрудник,
	|	ВТАвансИЗарплата.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТАвансИЗарплата.Подразделение КАК Подразделение,
	|	&ПериодРегистрации КАК ПериодВзаиморасчетов,
	|	ВТАвансИЗарплата.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ВТАвансИЗарплата.СтатьяРасходов КАК СтатьяРасходов,
	|	ВТАвансИЗарплата.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	|	ВТАвансИЗарплата.ДокументОснование КАК ДокументОснование,
	|	СУММА(ВТАвансИЗарплата.СуммаКВыплате) КАК КВыплате
	|ПОМЕСТИТЬ ВТЗарплатаКВыплате
	|ИЗ
	|	ВТАвансИЗарплата КАК ВТАвансИЗарплата
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТАвансИЗарплата.СтатьяРасходов,
	|	ВТАвансИЗарплата.Сотрудник,
	|	ВТАвансИЗарплата.СтатьяФинансирования,
	|	ВТАвансИЗарплата.ФизическоеЛицо,
	|	ВТАвансИЗарплата.Подразделение,
	|	ВТАвансИЗарплата.ВидДоходаИсполнительногоПроизводства,
	|	ВТАвансИЗарплата.ДокументОснование
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТАвансИЗарплата.СуммаКВыплате) <> 0";
	#КонецУдаления
	#Вставка
	//сделать, чтобы аванс выплачивался даже при наличии документа "Начисление зарплаты"
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗарплатаКВыплатеОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток КАК СуммаКВыплатеОстаток
	|ПОМЕСТИТЬ ВТОтрицательноеСальдоПоЗарплате
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате.Остатки(
	|			КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ),
	|			ПериодВзаиморасчетов < &ПериодРегистрации
	|				И Сотрудник В
	|					(ВЫБРАТЬ
	|						Сотрудники.Сотрудник
	|					ИЗ
	|						#ВТСотрудники КАК Сотрудники)) КАК ЗарплатаКВыплатеОстатки
	|ГДЕ
	|	ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗарплатаКВыплате.Сотрудник КАК Сотрудник,
	|	ЗарплатаКВыплате.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗарплатаКВыплате.Подразделение КАК Подразделение,
	|	ЗарплатаКВыплате.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ЗарплатаКВыплате.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗарплатаКВыплате.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	|	ЗарплатаКВыплате.ДокументОснование КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплате.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -ЗарплатаКВыплате.СуммаКВыплате
	|		ИНАЧЕ ЗарплатаКВыплате.СуммаКВыплате
	|	КОНЕЦ КАК СуммаКВыплате
	|ПОМЕСТИТЬ ВТОстаткиПоЗарплате
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате КАК ЗарплатаКВыплате
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтрицательноеСальдоПоЗарплате КАК ВТОтрицательноеСальдоПоЗарплате
	|		ПО ЗарплатаКВыплате.ФизическоеЛицо = ВТОтрицательноеСальдоПоЗарплате.ФизическоеЛицо
	|ГДЕ
	|	ЗарплатаКВыплате.Регистратор В(&ИгнорируемыеРегистраторы)
	|	И ЗарплатаКВыплате.Период < КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|	И ЗарплатаКВыплате.ПериодВзаиморасчетов < &ПериодРегистрации
	|	И ЗарплатаКВыплате.Сотрудник В
	|			(ВЫБРАТЬ
	|				Сотрудники.Сотрудник
	|			ИЗ
	|				#ВТСотрудники КАК Сотрудники)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗарплатаКВыплатеОстатки.Сотрудник,
	|	ЗарплатаКВыплатеОстатки.ФизическоеЛицо,
	|	ЗарплатаКВыплатеОстатки.Подразделение,
	|	ЗарплатаКВыплатеОстатки.СтатьяФинансирования,
	|	ЗарплатаКВыплатеОстатки.СтатьяРасходов,
	|	ЗарплатаКВыплатеОстатки.ВидДоходаИсполнительногоПроизводства,
	|	ЗарплатаКВыплатеОстатки.ДокументОснование,
	|	ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате.Остатки(
	|			КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ),
	|			Сотрудник В
	|					(ВЫБРАТЬ
	|						Сотрудники.Сотрудник
	|					ИЗ
	|						#ВТСотрудники КАК Сотрудники)
	|				И Организация = &Организация
	|				И ПериодВзаиморасчетов < &ПериодРегистрации) КАК ЗарплатаКВыплатеОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтрицательноеСальдоПоЗарплате КАК ВТОтрицательноеСальдоПоЗарплате
	|		ПО ЗарплатаКВыплатеОстатки.ФизическоеЛицо = ВТОтрицательноеСальдоПоЗарплате.ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыйАванс.Сотрудник КАК Сотрудник,
	|	ПлановыйАванс.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПлановыйАванс.Подразделение КАК Подразделение,
	|	ПлановыйАванс.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ПлановыйАванс.СтатьяРасходов КАК СтатьяРасходов,
	|	ПлановыйАванс.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОснование,
	|	ПлановыйАванс.СуммаКВыплате КАК СуммаКВыплате
	|ПОМЕСТИТЬ ВТАванс
	|ИЗ
	|	ВТПлановыйАванс КАК ПлановыйАванс
	|ГДЕ
	|	&ОтборПоСтатьям
	|	И ПлановыйАванс.ВидДоходаИсполнительногоПроизводства В(&ВидыДоходов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗарплатаКВыплатеАвансом.Сотрудник,
	|	ЗарплатаКВыплатеАвансом.ФизическоеЛицо,
	|	ЗарплатаКВыплатеАвансом.Подразделение,
	|	ЗарплатаКВыплатеАвансом.СтатьяФинансирования,
	|	ЗарплатаКВыплатеАвансом.СтатьяРасходов,
	|	ЗарплатаКВыплатеАвансом.ВидДоходаИсполнительногоПроизводства,
	|	ЗарплатаКВыплатеАвансом.ДокументОснование,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеАвансом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И ТИПЗНАЧЕНИЯ(ЗарплатаКВыплатеАвансом.Регистратор) = ТИПЗНАЧЕНИЯ(ЗарплатаКВыплатеАвансом.ДокументОснование)
	|			ТОГДА ЗарплатаКВыплатеАвансом.СуммаКВыплате
	|		КОГДА ЗарплатаКВыплатеАвансом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -1 * ЗарплатаКВыплатеАвансом.СуммаКВыплате
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаКВыплатеОстаток	
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплатеАвансом Как ЗарплатаКВыплатеАвансом
	|ГДЕ
	|НАЧАЛОПЕРИОДА(ЗарплатаКВыплатеАвансом.Период, МЕСЯЦ) < ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ), МЕСЯЦ, 1)
	|И ЗарплатаКВыплатеАвансом.ПериодВзаиморасчетов = &ПериодРегистрации
	|И ЗарплатаКВыплатеАвансом.Организация = &Организация
	|					И &ОтборПоСтатьям
	|					И ВидДоходаИсполнительногоПроизводства В (&ВидыДоходов)
	|					И Сотрудник В
	|						(ВЫБРАТЬ
	|							Сотрудники.Сотрудник
	|						ИЗ
	|							#ВТСотрудники КАК Сотрудники)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗарплатаКВыплате.Сотрудник,
	|	ЗарплатаКВыплате.ФизическоеЛицо,
	|	ЗарплатаКВыплате.Подразделение,
	|	ЗарплатаКВыплате.СтатьяФинансирования,
	|	ЗарплатаКВыплате.СтатьяРасходов,
	|	ЗарплатаКВыплате.ВидДоходаИсполнительногоПроизводства,
	|	ЗарплатаКВыплате.ДокументОснование,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплате.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -ЗарплатаКВыплате.СуммаКВыплате
	|		ИНАЧЕ ЗарплатаКВыплате.СуммаКВыплате
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплатеАвансом КАК ЗарплатаКВыплате
	|ГДЕ
	|	ЗарплатаКВыплате.Регистратор В(&ИгнорируемыеРегистраторы)
	|	И ЗарплатаКВыплате.Период < КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|	И ЗарплатаКВыплате.ПериодВзаиморасчетов = &ПериодРегистрации
	|	И ЗарплатаКВыплате.Организация = &Организация
	|	И &ОтборПоСтатьям
	|	И ЗарплатаКВыплате.ВидДоходаИсполнительногоПроизводства В(&ВидыДоходов)
	|	И ЗарплатаКВыплате.Сотрудник В
	|			(ВЫБРАТЬ
	|				Сотрудники.Сотрудник
	|			ИЗ
	|				#ВТСотрудники КАК Сотрудники)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстаткиПоЗарплате.Сотрудник КАК Сотрудник,
	|	ВТОстаткиПоЗарплате.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТОстаткиПоЗарплате.Подразделение КАК Подразделение,
	|	ВТОстаткиПоЗарплате.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ВТОстаткиПоЗарплате.СтатьяРасходов КАК СтатьяРасходов,
	|	ВТОстаткиПоЗарплате.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	|	ВТОстаткиПоЗарплате.ДокументОснование КАК ДокументОснование,
	|	ВТОстаткиПоЗарплате.СуммаКВыплате КАК СуммаКВыплате
	|ПОМЕСТИТЬ ВТАвансИЗарплата
	|ИЗ
	|	ВТОстаткиПоЗарплате КАК ВТОстаткиПоЗарплате
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТАванс.Сотрудник,
	|	ВТАванс.ФизическоеЛицо,
	|	ВТАванс.Подразделение,
	|	ВТАванс.СтатьяФинансирования,
	|	ВТАванс.СтатьяРасходов,
	|	ВТАванс.ВидДоходаИсполнительногоПроизводства,
	|	ВТАванс.ДокументОснование,
	|	ВТАванс.СуммаКВыплате
	|ИЗ
	|	ВТАванс КАК ВТАванс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТАвансИЗарплата.Сотрудник КАК Сотрудник,
	|	ВТАвансИЗарплата.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТАвансИЗарплата.Подразделение КАК Подразделение,
	|	&ПериодРегистрации КАК ПериодВзаиморасчетов,
	|	ВТАвансИЗарплата.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ВТАвансИЗарплата.СтатьяРасходов КАК СтатьяРасходов,
	|	ВТАвансИЗарплата.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	|	ВТАвансИЗарплата.ДокументОснование КАК ДокументОснование,
	|	СУММА(ВТАвансИЗарплата.СуммаКВыплате) КАК КВыплате
	|ПОМЕСТИТЬ ВТЗарплатаКВыплате
	|ИЗ
	|	ВТАвансИЗарплата КАК ВТАвансИЗарплата
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТАвансИЗарплата.СтатьяРасходов,
	|	ВТАвансИЗарплата.Сотрудник,
	|	ВТАвансИЗарплата.СтатьяФинансирования,
	|	ВТАвансИЗарплата.ФизическоеЛицо,
	|	ВТАвансИЗарплата.Подразделение,
	|	ВТАвансИЗарплата.ВидДоходаИсполнительногоПроизводства,
	|	ВТАвансИЗарплата.ДокументОснование
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТАвансИЗарплата.СуммаКВыплате) <> 0";
	#КонецВставки
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст, 
		"&ОтборПоСтатьям", 
		ВзаиморасчетыССотрудниками.ОтборПоСтатьямЗарплатыКВыплате(Параметры));
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст, 
		"#ВТСотрудники", 
		ИмяВТСотрудники);
	
	Запрос.Выполнить();
	
	УничтожаемыеВТ = Новый Массив;
	УничтожаемыеВТ.Добавить("ВТОтрицательноеСальдоПоЗарплате");
	УничтожаемыеВТ.Добавить("ВТОстаткиПоЗарплате");
	УничтожаемыеВТ.Добавить("ВТАванс");
	УничтожаемыеВТ.Добавить("ВТАвансИЗарплата");
	УничтожаемыеВТ.Добавить("ВТПлановыйАванс");
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УничтожаемыеВТ); 
	
КонецПроцедуры
